Revit 2027 API
RebarUpdateCurvesData.GetBarsNumber Method
 Gets the number of bars specified in the layout options. This is used to calculate the sets driven by bar number.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetBarsNumber()
Public Function GetBarsNumber As Integer
public:
int GetBarsNumber()
member GetBarsNumber : unit -> int
Return Value
Int32
 Returns the number of bars specified in the layout options.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace